In [1]:
# importing libraries
import pandas as pd
import numpy as np

In [4]:
data = {'name': ['Asif', 'pervej', 'Naharul', 'Hasan', "Asad", 'Rakib', 'Asifa'],
        'Age': [25, 40, 34, 20, 75, np.NaN, 28],
        'Sex': ['male', 'male', 'male', 'female',  np.NaN, 'male', 'female']
        }
df = pd.DataFrame(data)
df

      name   Age     Sex
0     Asif  25.0    male
1   pervej  40.0    male
2  Naharul  34.0    male
3    Hasan  20.0  female
4     Asad  75.0     NaN
5    Rakib   NaN    male
6    Asifa  28.0  female

In [8]:
a =df['Age'].fillna(df['Age'].mean())

In [11]:
a

0    25.0
1    40.0
2    34.0
3    20.0
4    75.0
5    37.0
6    28.0
Name: Age, dtype: float64

In [9]:
type(a)

pandas.core.series.Series

In [10]:
df['Age'].fillna(df['Age'].mean())

0    25.0
1    40.0
2    34.0
3    20.0
4    75.0
5    37.0
6    28.0
Name: Age, dtype: float64

In [7]:
df

      name   Age     Sex
0     Asif  25.0    male
1   pervej  40.0    male
2  Naharul  34.0    male
3    Hasan  20.0  female
4     Asad  75.0     NaN
5    Rakib   NaN    male
6    Asifa  28.0  female

In [12]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [13]:
df

      name   Age     Sex
0     Asif  25.0    male
1   pervej  40.0    male
2  Naharul  34.0    male
3    Hasan  20.0  female
4     Asad  75.0     NaN
5    Rakib  37.0    male
6    Asifa  28.0  female

In [22]:
mode_value = df['Sex'].mode()
df['Sex'] = df['Sex'].fillna(mode_value[0])
df

      name   Age     Sex  Gender_mapping
0     Asif  25.0    male             1.0
1   pervej  40.0    male             1.0
2  Naharul  34.0    male             1.0
3    Hasan  20.0  female             0.0
4     Asad  75.0    male             NaN
5    Rakib  37.0    male             1.0
6    Asifa  28.0  female             0.0

In [15]:
df['Sex'].mode()

0    male
Name: Sex, dtype: object

In [19]:
df['Gender_mapping'] = df['Sex'].map({'male': 1, 'female': 0})

In [20]:
df

      name   Age     Sex  Gender_mapping
0     Asif  25.0    male             1.0
1   pervej  40.0    male             1.0
2  Naharul  34.0    male             1.0
3    Hasan  20.0  female             0.0
4     Asad  75.0     NaN             NaN
5    Rakib  37.0    male             1.0
6    Asifa  28.0  female             0.0

In [23]:
df['Gender_mapping'].fillna(df['Gender_mapping'].mode()[0])

0    1.0
1    1.0
2    1.0
3    0.0
4    1.0
5    1.0
6    0.0
Name: Gender_mapping, dtype: float64

In [24]:
# loc = label based
# iloc = index based

df.iloc[3]

name               Hasan
Age                 20.0
Sex               female
Gender_mapping       0.0
Name: 3, dtype: object

In [25]:
df.iloc[3,1]

20.0

In [27]:
data = {'A': [1,2,3], 'B':[4,5,6]}
df1 = pd.DataFrame(data, index=['X', 'Y', 'Z'])
df1

   A  B
X  1  4
Y  2  5
Z  3  6

In [28]:
df1.iloc[0]

A    1
B    4
Name: X, dtype: int64

In [31]:
df1.loc['Z']

A    3
B    6
Name: Z, dtype: int64

In [32]:
df1.loc['Z', 'B']

6

In [33]:
df

      name   Age     Sex  Gender_mapping
0     Asif  25.0    male             1.0
1   pervej  40.0    male             1.0
2  Naharul  34.0    male             1.0
3    Hasan  20.0  female             0.0
4     Asad  75.0    male             NaN
5    Rakib  37.0    male             1.0
6    Asifa  28.0  female             0.0

In [35]:
b = df.groupby('Sex')['Age'].mean()

In [36]:
type(b)

pandas.core.series.Series

In [37]:
df.groupby('Sex')['Age'].mean().reset_index()

# df.groupby(['Sex', 'Area'])['Age'].mean().reset_index()

      Sex   Age
0  female  24.0
1    male  42.2

In [39]:
df.agg({'Age': ['max', 'min'],
        'Gender_mapping': 'mode' })

      Age Gender_mapping
      Age           mode
max  75.0            NaN
min  20.0            NaN
0     NaN            1.0

In [41]:
c = df.agg({'Age': ['max', 'min'],
        'Gender_mapping': 'mode' })
c

      Age Gender_mapping
      Age           mode
max  75.0            NaN
min  20.0            NaN
0     NaN            1.0

In [42]:
df.rename(columns={'Sex': 'Gender'})

      name   Age  Gender  Gender_mapping
0     Asif  25.0    male             1.0
1   pervej  40.0    male             1.0
2  Naharul  34.0    male             1.0
3    Hasan  20.0  female             0.0
4     Asad  75.0    male             NaN
5    Rakib  37.0    male             1.0
6    Asifa  28.0  female             0.0

In [44]:
# Join -> left join, right join, inner join, full join
df2 = pd.DataFrame({'Key': ['a', 'b', 'c', 'd'], 'value': [1,2,3,4]})
df3 = pd.DataFrame({'Key': ['b', 'c', 'e', 'f'], 'value': [5,6,7,8]})

In [45]:
df2

  Key  value
0   a      1
1   b      2
2   c      3
3   d      4

In [46]:
df3

  Key  value
0   b      5
1   c      6
2   e      7
3   f      8

In [48]:
merged_df = pd.merge(df2, df3, on='Key', how='left')
merged_df

  Key  value_x  value_y
0   a        1      NaN
1   b        2      5.0
2   c        3      6.0
3   d        4      NaN

In [49]:
df4 = pd.DataFrame({'Key1': ['a', 'b', 'c', 'd'], 'value1': [1,2,3,4]})
df5 = pd.DataFrame({'Key2': ['b', 'c', 'e', 'f'], 'value2': [5,6,7,8]})

In [50]:
df4

  Key1  value1
0    a       1
1    b       2
2    c       3
3    d       4

In [51]:
df5

  Key2  value2
0    b       5
1    c       6
2    e       7
3    f       8

In [53]:
merged = pd.merge(df4, df5, left_on='Key1', right_on='Key2', how='left')
merged

  Key1  value1 Key2  value2
0    a       1  NaN     NaN
1    b       2    b     5.0
2    c       3    c     6.0
3    d       4  NaN     NaN

In [54]:
pd.concat([df2, df3], axis=1)

  Key  value Key  value
0   a      1   b      5
1   b      2   c      6
2   c      3   e      7
3   d      4   f      8

In [55]:
pd.concat([df2,df3], axis=0)

  Key  value
0   a      1
1   b      2
2   c      3
3   d      4
0   b      5
1   c      6
2   e      7
3   f      8